Continued apply output from previous comment.
<details><summary>Show Output</summary>

```diff
ed
  + resource "aws_api_gateway_integration" "admin_proxy" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "ANY"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "v6g40p"
      + rest_api_id             = "wfavief721"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.analyses will be created
  + resource "aws_api_gateway_integration" "analyses" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "zbiv26"
      + rest_api_id             = "wfavief721"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.analyses-filtering_terms will be created
  + resource "aws_api_gateway_integration" "analyses-filtering_terms" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "3p0rl2"
      + rest_api_id             = "wfavief721"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.analyses-filtering_terms_post will be created
  + resource "aws_api_gateway_integration" "analyses-filtering_terms_post" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "3p0rl2"
      + rest_api_id             = "wfavief721"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.analyses-id will be created
  + resource "aws_api_gateway_integration" "analyses-id" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "r6g9en"
      + rest_api_id             = "wfavief721"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.analyses-id-g_variants will be created
  + resource "aws_api_gateway_integration" "analyses-id-g_variants" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "x0yxrr"
      + rest_api_id             = "wfavief721"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.analyses-id-g_variants_post will be created
  + resource "aws_api_gateway_integration" "analyses-id-g_variants_post" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "x0yxrr"
      + rest_api_id             = "wfavief721"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.analyses-id_post will be created
  + resource "aws_api_gateway_integration" "analyses-id_post" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "r6g9en"
      + rest_api_id             = "wfavief721"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.analyses_post will be created
  + resource "aws_api_gateway_integration" "analyses_post" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "zbiv26"
      + rest_api_id             = "wfavief721"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.biosamples will be created
  + resource "aws_api_gateway_integration" "biosamples" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "1zoxya"
      + rest_api_id             = "wfavief721"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.biosamples-filtering_terms will be created
  + resource "aws_api_gateway_integration" "biosamples-filtering_terms" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "cxcmgq"
      + rest_api_id             = "wfavief721"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.biosamples-filtering_terms_post will be created
  + resource "aws_api_gateway_integration" "biosamples-filtering_terms_post" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "cxcmgq"
      + rest_api_id             = "wfavief721"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.biosamples-id will be created
  + resource "aws_api_gateway_integration" "biosamples-id" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "srad5w"
      + rest_api_id             = "wfavief721"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.biosamples-id-analyses will be created
  + resource "aws_api_gateway_integration" "biosamples-id-analyses" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "ux4wkm"
      + rest_api_id             = "wfavief721"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.biosamples-id-analyses_post will be created
  + resource "aws_api_gateway_integration" "biosamples-id-analyses_post" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "ux4wkm"
      + rest_api_id             = "wfavief721"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.biosamples-id-g_variants will be created
  + resource "aws_api_gateway_integration" "biosamples-id-g_variants" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "re455d"
      + rest_api_id             = "wfavief721"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.biosamples-id-g_variants_post will be created
  + resource "aws_api_gateway_integration" "biosamples-id-g_variants_post" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "re455d"
      + rest_api_id             = "wfavief721"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.biosamples-id-runs will be created
  + resource "aws_api_gateway_integration" "biosamples-id-runs" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "yjzd6q"
      + rest_api_id             = "wfavief721"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.biosamples-id-runs_post will be created
  + resource "aws_api_gateway_integration" "biosamples-id-runs_post" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "yjzd6q"
      + rest_api_id             = "wfavief721"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.biosamples-id_post will be created
  + resource "aws_api_gateway_integration" "biosamples-id_post" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "srad5w"
      + rest_api_id             = "wfavief721"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.biosamples_post will be created
  + resource "aws_api_gateway_integration" "biosamples_post" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "1zoxya"
      + rest_api_id             = "wfavief721"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.configuration will be created
  + resource "aws_api_gateway_integration" "configuration" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "kx113a"
      + rest_api_id             = "wfavief721"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.datasets will be created
  + resource "aws_api_gateway_integration" "datasets" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "y3hb5m"
      + rest_api_id             = "wfavief721"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.datasets-filtering_terms will be created
  + resource "aws_api_gateway_integration" "datasets-filtering_terms" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "0kjrew"
      + rest_api_id             = "wfavief721"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.datasets-filtering_terms_post will be created
  + resource "aws_api_gateway_integration" "datasets-filtering_terms_post" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "0kjrew"
      + rest_api_id             = "wfavief721"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.datasets-id will be created
  + resource "aws_api_gateway_integration" "datasets-id" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "7dagqd"
      + rest_api_id             = "wfavief721"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.datasets-id-biosamples will be created
  + resource "aws_api_gateway_integration" "datasets-id-biosamples" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "6eexan"
      + rest_api_id             = "wfavief721"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.datasets-id-biosamples_post will be created
  + resource "aws_api_gateway_integration" "datasets-id-biosamples_post" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "6eexan"
      + rest_api_id             = "wfavief721"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.datasets-id-filtering_terms will be created
  + resource "aws_api_gateway_integration" "datasets-id-filtering_terms" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "4tfmup"
      + rest_api_id             = "wfavief721"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.datasets-id-filtering_terms_post will be created
  + resource "aws_api_gateway_integration" "datasets-id-filtering_terms_post" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "4tfmup"
      + rest_api_id             = "wfavief721"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.datasets-id-g_variants will be created
  + resource "aws_api_gateway_integration" "datasets-id-g_variants" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "otus0z"
      + rest_api_id             = "wfavief721"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.datasets-id-g_variants_post will be created
  + resource "aws_api_gateway_integration" "datasets-id-g_variants_post" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "otus0z"
      + rest_api_id             = "wfavief721"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.datasets-id-individuals will be created
  + resource "aws_api_gateway_integration" "datasets-id-individuals" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "8i72qo"
      + rest_api_id             = "wfavief721"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.datasets-id-individuals_post will be created
  + resource "aws_api_gateway_integration" "datasets-id-individuals_post" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "8i72qo"
      + rest_api_id             = "wfavief721"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.datasets-id_post will be created
  + resource "aws_api_gateway_integration" "datasets-id_post" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "7dagqd"
      + rest_api_id             = "wfavief721"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.datasets_post will be created
  + resource "aws_api_gateway_integration" "datasets_post" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "y3hb5m"
      + rest_api_id             = "wfavief721"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.dportal_proxy will be created
  + resource "aws_api_gateway_integration" "dportal_proxy" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "ANY"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "nam5qf"
      + rest_api_id             = "wfavief721"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.entry_types will be created
  + resource "aws_api_gateway_integration" "entry_types" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "a88e4r"
      + rest_api_id             = "wfavief721"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.filtering_terms will be created
  + resource "aws_api_gateway_integration" "filtering_terms" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "uds2w5"
      + rest_api_id             = "wfavief721"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.g_variants will be created
  + resource "aws_api_gateway_integration" "g_variants" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "zfefrf"
      + rest_api_id             = "wfavief721"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.g_variants-id will be created
  + resource "aws_api_gateway_integration" "g_variants-id" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "jhbvft"
      + rest_api_id             = "wfavief721"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.g_variants-id-biosamples will be created
  + resource "aws_api_gateway_integration" "g_variants-id-biosamples" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "mvrw3g"
      + rest_api_id             = "wfavief721"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.g_variants-id-biosamples_post will be created
  + resource "aws_api_gateway_integration" "g_variants-id-biosamples_post" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "mvrw3g"
      + rest_api_id             = "wfavief721"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.g_variants-id-individuals will be created
  + resource "aws_api_gateway_integration" "g_variants-id-individuals" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "egwaf8"
      + rest_api_id             = "wfavief721"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.g_variants-id-individuals_post will be created
  + resource "aws_api_gateway_integration" "g_variants-id-individuals_post" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "egwaf8"
      + rest_api_id             = "wfavief721"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.g_variants-id_post will be created
  + resource "aws_api_gateway_integration" "g_variants-id_post" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "jhbvft"
      + rest_api_id             = "wfavief721"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.g_variants_post will be created
  + resource "aws_api_gateway_integration" "g_variants_post" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "zfefrf"
      + rest_api_id             = "wfavief721"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.individuals will be created
  + resource "aws_api_gateway_integration" "individuals" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "w6hskl"
      + rest_api_id             = "wfavief721"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.individuals-filtering_terms will be created
  + resource "aws_api_gateway_integration" "individuals-filtering_terms" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "e1fux0"
      + rest_api_id             = "wfavief721"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.individuals-filtering_terms_post will be created
  + resource "aws_api_gateway_integration" "individuals-filtering_terms_post" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "e1fux0"
      + rest_api_id             = "wfavief721"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.individuals-id will be created
  + resource "aws_api_gateway_integration" "individuals-id" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "j0lt7b"
      + rest_api_id             = "wfavief721"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.individuals-id-biosamples will be created
  + resource "aws_api_gateway_integration" "individuals-id-biosamples" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "cm0ykk"
      + rest_api_id             = "wfavief721"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.individuals-id-biosamples_post will be created
  + resource "aws_api_gateway_integration" "individuals-id-biosamples_post" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "cm0ykk"
      + rest_api_id             = "wfavief721"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.individuals-id-g_variants will be created
  + resource "aws_api_gateway_integration" "individuals-id-g_variants" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "rtt1l7"
      + rest_api_id             = "wfavief721"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.individuals-id-g_variants_post will be created
  + resource "aws_api_gateway_integration" "individuals-id-g_variants_post" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "rtt1l7"
      + rest_api_id             = "wfavief721"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.individuals-id_post will be created
  + resource "aws_api_gateway_integration" "individuals-id_post" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "j0lt7b"
      + rest_api_id             = "wfavief721"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.individuals_post will be created
  + resource "aws_api_gateway_integration" "individuals_post" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "w6hskl"
      + rest_api_id             = "wfavief721"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.info will be created
  + resource "aws_api_gateway_integration" "info" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "7p4ge2"
      + rest_api_id             = "wfavief721"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.map will be created
  + resource "aws_api_gateway_integration" "map" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "oio1wd"
      + rest_api_id             = "wfavief721"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.projects will be created
  + resource "aws_api_gateway_integration" "projects" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "nvu8df"
      + rest_api_id             = "wfavief721"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.root-get will be created
  + resource "aws_api_gateway_integration" "root-get" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "k9orycq4bf"
      + rest_api_id             = "wfavief721"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.runs will be created
  + resource "aws_api_gateway_integration" "runs" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "zj9kwx"
      + rest_api_id             = "wfavief721"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.runs-filtering_terms will be created
  + resource "aws_api_gateway_integration" "runs-filtering_terms" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "ocbafw"
      + rest_api_id             = "wfavief721"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.runs-filtering_terms_post will be created
  + resource "aws_api_gateway_integration" "runs-filtering_terms_post" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "ocbafw"
      + rest_api_id             = "wfavief721"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.runs-id will be created
  + resource "aws_api_gateway_integration" "runs-id" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "3a0k7f"
      + rest_api_id             = "wfavief721"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.runs-id-analyses will be created
  + resource "aws_api_gateway_integration" "runs-id-analyses" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "d6x3d0"
      + rest_api_id             = "wfavief721"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.runs-id-analyses_post will be created
  + resource "aws_api_gateway_integration" "runs-id-analyses_post" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "d6x3d0"
      + rest_api_id             = "wfavief721"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.runs-id-g_variants will be created
  + resource "aws_api_gateway_integration" "runs-id-g_variants" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "h7z0fn"
      + rest_api_id             = "wfavief721"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.runs-id-g_variants_post will be created
  + resource "aws_api_gateway_integration" "runs-id-g_variants_post" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "h7z0fn"
      + rest_api_id             = "wfavief721"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.runs-id_post will be created
  + resource "aws_api_gateway_integration" "runs-id_post" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "3a0k7f"
      + rest_api_id             = "wfavief721"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration.runs_post will be created
  + resource "aws_api_gateway_integration" "runs_post" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "zj9kwx"
      + rest_api_id             = "wfavief721"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration_response.admin_proxy will be created
  + resource "aws_api_gateway_integration_response" "admin_proxy" {
      + http_method        = "ANY"
      + id                 = (known after apply)
      + resource_id        = "v6g40p"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "wfavief721"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.analyses will be created
  + resource "aws_api_gateway_integration_response" "analyses" {
      + http_method        = "GET"
      + id                 = (known after apply)
      + resource_id        = "zbiv26"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "wfavief721"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.analyses-filtering_terms will be created
  + resource "aws_api_gateway_integration_response" "analyses-filtering_terms" {
      + http_method        = "GET"
      + id                 = (known after apply)
      + resource_id        = "3p0rl2"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "wfavief721"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.analyses-filtering_terms_post will be created
  + resource "aws_api_gateway_integration_response" "analyses-filtering_terms_post" {
      + http_method        = "POST"
      + id                 = (known after apply)
      + resource_id        = "3p0rl2"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "wfavief721"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.analyses-id will be created
  + resource "aws_api_gateway_integration_response" "analyses-id" {
      + http_method        = "GET"
      + id                 = (known after apply)
      + resource_id        = "r6g9en"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "wfavief721"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.analyses-id-g_variants will be created
  + resource "aws_api_gateway_integration_response" "analyses-id-g_variants" {
      + http_method        = "GET"
      + id                 = (known after apply)
      + resource_id        = "x0yxrr"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "wfavief721"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.analyses-id-g_variants_post will be created
  + resource "aws_api_gateway_integration_response" "analyses-id-g_variants_post" {
      + http_method        = "POST"
      + id                 = (known after apply)
      + resource_id        = "x0yxrr"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "wfavief721"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.analyses-id_post will be created
  + resource "aws_api_gateway_integration_response" "analyses-id_post" {
      + http_method        = "POST"
      + id                 = (known after apply)
      + resource_id        = "r6g9en"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "wfavief721"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.analyses_post will be created
  + resource "aws_api_gateway_integration_response" "analyses_post" {
      + http_method        = "POST"
      + id                 = (known after apply)
      + resource_id        = "zbiv26"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "wfavief721"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.biosamples will be created
  + resource "aws_api_gateway_integration_response" "biosamples" {
      + http_method        = "GET"
      + id                 = (known after apply)
      + resource_id        = "1zoxya"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "wfavief721"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.biosamples-filtering_terms will be created
  + resource "aws_api_gateway_integration_response" "biosamples-filtering_terms" {
      + http_method        = "GET"
      + id                 = (known after apply)
      + resource_id        = "cxcmgq"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "wfavief721"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.biosamples-filtering_terms_post will be created
  + resource "aws_api_gateway_integration_response" "biosamples-filtering_terms_post" {
      + http_method        = "POST"
      + id                 = (known after apply)
      + resource_id        = "cxcmgq"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "wfavief721"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.biosamples-id will be created
  + resource "aws_api_gateway_integration_response" "biosamples-id" {
      + http_method        = "GET"
      + id                 = (known after apply)
      + resource_id        = "srad5w"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "wfavief721"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.biosamples-id-analyses will be created
  + resource "aws_api_gateway_integration_response" "biosamples-id-analyses" {
      + http_method        = "GET"
      + id                 = (known after apply)
      + resource_id        = "ux4wkm"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "wfavief721"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.biosamples-id-analyses_post will be created
  + resource "aws_api_gateway_integration_response" "biosamples-id-analyses_post" {
      + http_method        = "POST"
      + id                 = (known after apply)
      + resource_id        = "ux4wkm"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "wfavief721"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.biosamples-id-g_variants will be created
  + resource "aws_api_gateway_integration_response" "biosamples-id-g_variants" {
      + http_method        = "GET"
      + id                 = (known after apply)
      + resource_id        = "re455d"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "wfavief721"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.biosamples-id-g_variants_post will be created
  + resource "aws_api_gateway_integration_response" "biosamples-id-g_variants_post" {
      + http_method        = "POST"
      + id                 = (known after apply)
      + resource_id        = "re455d"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "wfavief721"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.biosamples-id-runs will be created
  + resource "aws_api_gateway_integration_response" "biosamples-id-runs" {
      + http_method        = "GET"
      + id                 = (known after apply)
      + resource_id        = "yjzd6q"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "wfavief721"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.biosamples-id-runs_post will be created
  + resource "aws_api_gateway_integration_response" "biosamples-id-runs_post" {
      + http_method        = "POST"
      + id                 = (known after apply)
      + resource_id        = "yjzd6q"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "wfavief721"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.biosamples-id_post will be created
  + resource "aws_api_gateway_integration_response" "biosamples-id_post" {
      + http_method        = "POST"
      + id                 = (known after apply)
      + resource_id        = "srad5w"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "wfavief721"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.biosamples_post will be created
  + resource "aws_api_gateway_integration_response" "biosamples_post" {
      + http_method        = "POST"
      + id                 = (known after apply)
      + resource_id        = "1zoxya"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "wfavief721"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.configuration will be created
  + resource "aws_api_gateway_integration_response" "configuration" {
      + http_method        = "GET"
      + id                 = (known after apply)
      + resource_id        = "kx113a"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "wfavief721"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.datasets will be created
  + resource "aws_api_gateway_integration_response" "datasets" {
      + http_method        = "GET"
      + id                 = (known after apply)
      + resource_id        = "y3hb5m"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "wfavief721"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.datasets-filtering_terms will be created
  + resource "aws_api_gateway_integration_response" "datasets-filtering_terms" {
      + http_method        = "GET"
      + id                 = (known after apply)
      + resource_id        = "0kjrew"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "wfavief721"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.datasets-filtering_terms_post will be created
  + resource "aws_api_gateway_integration_response" "datasets-filtering_terms_post" {
      + http_method        = "POST"
      + id                 = (known after apply)
      + resource_id        = "0kjrew"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "wfavief721"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.datasets-id will be created
  + resource "aws_api_gateway_integration_response" "datasets-id" {
      + http_method        = "GET"
      + id                 = (known after apply)
      + resource_id        = "7dagqd"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "wfavief721"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.datasets-id-biosamples will be created
  + resource "aws_api_gateway_integration_response" "datasets-id-biosamples" {
      + http_method        = "GET"
      + id                 = (known after apply)
      + resource_id        = "6eexan"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "wfavief721"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.datasets-id-biosamples_post will be created
  + resource "aws_api_gateway_integration_response" "datasets-id-biosamples_post" {
      + http_method        = "POST"
      + id                 = (known after apply)
      + resource_id        = "6eexan"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "wfavief721"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.datasets-id-filtering_terms will be created
  + resource "aws_api_gateway_integration_response" "datasets-id-filtering_terms" {
      + http_method        = "GET"
      + id                 = (known after apply)
      + resource_id        = "4tfmup"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "wfavief721"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.datasets-id-filtering_terms_post will be created
  + resource "aws_api_gateway_integration_response" "datasets-id-filtering_terms_post" {
      + http_method        = "POST"
      + id                 = (known after apply)
      + resource_id        = "4tfmup"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "wfavief721"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.datasets-id-g_variants will be created
  + resource "aws_api_gateway_integration_response" "datasets-id-g_variants" {
      + http_method        = "GET"
      + id                 = (known after apply)
      + resource_id        = "otus0z"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "wfavief721"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.datasets-id-g_variants_post will be created
  + resource "aws_api_gateway_integration_response" "datasets-id-g_variants_post" {
      + http_method        = "POST"
      + id                 = (known after apply)
      + resource_id        = "otus0z"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "wfavief721"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.datasets-id-individuals will be created
  + resource "aws_api_gateway_integration_response" "datasets-id-individuals" {
      + http_method        = "GET"
      + id                 = (known after apply)
      + resource_id        = "8i72qo"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "wfavief721"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.datasets-id-individuals_post will be created
  + resource "aws_api_gateway_integration_response" "datasets-id-individuals_post" {
      + http_method        = "POST"
      + id                 = (known after apply)
      + resource_id        = "8i72qo"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "wfavief721"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.datasets-id_post will be created
  + resource "aws_api_gateway_integration_response" "datasets-id_post" {
      + http_method        = "POST"
      + id                 = (known after apply)
      + resource_id        = "7dagqd"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "wfavief721"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.datasets_post will be created
  + resource "aws_api_gateway_integration_response" "datasets_post" {
      + http_method        = "POST"
      + id                 = (known after apply)
      + resource_id        = "y3hb5m"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "wfavief721"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.dportal_proxy will be created
  + resource "aws_api_gateway_integration_response" "dportal_proxy" {
      + http_method        = "ANY"
      + id                 = (known after apply)
      + resource_id        = "nam5qf"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "wfavief721"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.entry_types will be created
  + resource "aws_api_gateway_integration_response" "entry_types" {
      + http_method        = "GET"
      + id                 = (known after apply)
      + resource_id        = "a88e4r"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "wfavief721"
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.filtering_terms
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.